# ============================================
# Test: Array Operations
# Category: tutorial
# Expected: All commands should pass
# ============================================

# --------------------------------------------
# Section: Creating Arrays
# --------------------------------------------
ml> empty = [];
ml> empty
[]
ml> numbers = [1, 2, 3, 4, 5];
ml> numbers
[1, 2, 3, 4, 5]

# --------------------------------------------
# Section: Array Concatenation
# --------------------------------------------
ml> arr1 = [1, 2, 3];
ml> arr2 = [4, 5, 6];
ml> combined = arr1 + arr2;
ml> combined
[1, 2, 3, 4, 5, 6]

# --------------------------------------------
# Section: Adding Elements
# --------------------------------------------
ml> list = [10, 20];
ml> list = list + [30];
ml> list
[10, 20, 30]
ml> list = list + [40];
ml> list
[10, 20, 30, 40]

# --------------------------------------------
# Section: Array Length
# --------------------------------------------
ml> items = [1, 2, 3, 4, 5];
ml> len(items)
5
