# ============================================
# Test: Conditional Logic in Loops
# Category: tutorial
# Expected: All commands should pass
# ============================================

# --------------------------------------------
# Section: Conditional Checks
# --------------------------------------------
ml> value = 5;
ml> value == 5
True
ml> value > 10
False

# --------------------------------------------
# Section: Early Exit Condition
# --------------------------------------------
ml> numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9];
ml> target = 6;
ml> numbers[5]
6
ml> numbers[5] == target
True

# --------------------------------------------
# Section: Filtering Values
# --------------------------------------------
ml> num = 10;
ml> num % 2 == 0
True
ml> num2 = 7;
ml> num2 % 2 == 0
False
